Revit 2027 API
ParameterTypeId.ViewScale Property
 "Scale Value 1:"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewScale { get; }
Public Shared ReadOnly Property ViewScale As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewScale {
	ForgeTypeId^ get ();
}
static member ViewScale : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace